class PersonalDescription{

  static const String MinLu = '''မင်းလူကို စာရေးဆရာ ရုပ်ရှင် ဒါရိုက်တာ ဦးသာဓု၊ ကျောင်းအုပ် ဆရာမကြီး ဒေါ်ခင်ညို တို့မှ ရန်ကုန်မြို့ အမှတ် (၁၄၇) (၄၇)လမ်းတွင် မေ ၁၈ ရက်နေ့ ၁၉၅၄ ခုနှစ်၌ မွေးဖွားခဲ့သည်။ မွေးချင်းလေးယောက်အနက် အငယ်ဆုံး ဖြစ်သည်။ အမည်ရင်းမှာ မောင်ဉာဏ်ပေါ် ဖြစ်သည်။


၁၉၅၉ ခုနှစ်မှ ၁၉၆၈ ခုနှစ် အထိ စိန်ပေါ အထက်တန်းကျောင်း (နောင် အထက (၆)၊ ဗိုလ်တထောင်) ၌ ပညာသင်ကြားခဲ့သည်။ ၁၉၆၈ မှ ၁၉၇၂ အထိ အထက (၁) သင်္ကန်းကျွန်းကျောင်းသို့ ပြောင်းရွှေ့ ပညာသင်ကြားခဲ့ပြီး အခြေခံပညာ အထက်တန်း အောင်မြင်ခဲ့သည်။ ကျောင်းသားဘဝတွင် စာပေ ဖွံ့ဖြိုး တိုးတက်ရေး အဖွဲ့ အတွင်းရေးမှူးနှင့် သိပ္ပံပညာအသင်း တွဲဖက်အတွင်းရေးမှူးအဖြစ် ဆောင်ရွက် ခဲ့သည်။


၁၉၇၂ ခုနှစ်မှ ၁၉၇၇ ခုနှစ်ထိ ရန်ကုန် တက္ကသိုလ်တွင် တက်ရောက် သင်ကြားပြီး ဝိဇ္ဇာဘွဲ့ (ဒဿနိကဗေဒ) ကို ရရှိခဲ့သည်။ တက္ကသိုလ် နံရံကပ် စာစောင်နှင့် နှစ်ပတ်လည် မဂ္ဂဇင်း တို့တွင် တောကျောင်း ဘုန်းကြီး အမည်ဖြင့် ကဗျာများရေးသားခဲ့သည်။ စာအုပ်ထုတ်ဝေရေးလုပ်ငန်းလုပ်ဆောင်ခဲ့သည်။ ကျောင်းသားလှုပ်ရှားမှုတွင် ပါဝင်ခဲ့ပြီး ခေတ္တထိန်းသိမ်းခံခဲ့ရသည်။


၁၉၇၆ ခုနှစ်တွင် ရုပ်ရှင် ပဒေသာ မဂ္ဂဇင်း၌ ""နေဝင်သွားတော့ လထွက်သည်"""ဝတ္ထုတို စတင် ဖော်ပြခံပြီး စာပေနယ်သို့ ဝင်ရောက်ခဲ့သည်။


မစန်းစန်းအောင် (တက္ကသိုလ် စာကြည့်တိုက် ဝန်ထမ်း) နှင့် ၁၉၈၁ ခုနှစ်တွင် လက်ထပ်ခဲ့ရာ သူမ နှင့် စာရေးဆရာမ ယုယဟူ၍ သမီးနှစ်ဦး ထွန်းကားခဲ့သည်။ ၁၉၉၂ ခုနှစ်တွင် ဗီဒီယိုနှင့် ရုပ်ရှင် ဇာတ်ညွှန်းများစတင်ရေးသားခဲ့သည်။

၁၉၈၉ ခု၊ စက်တင်ဘာလ ၂၆ ရက်တွင် "ဘာတွေဖြစ်ကုန်ကြပြီလဲ" ဆိုသည့် ၁၉၈၈ နောက်ပိုင်း ခေတ်စနစ်ကို ရောင်ပြန်ဟပ်စေသည့် ကဗျာရှည်ကို ရေးသားခဲ့သည့်အတွက် တည်းဖြတ်သူ မျိုးမြင့်ညိမ်း၊ ထုတ်ဝေသူ ကိုစိန်လှိုင်တို့နှင့်အတူ ထောင်ဒဏ် (၇) နှစ် ကျခံခဲ့ရသည်။ [၁][၂]

၁၉၉၁ မှ ၁၉၉၃ ထိ စာအုပ်များ ရေးသားထုတ်ဝေနိုင်ခြင်းမရှိခဲ့ချေ။

၂၀၀၉ ခုနှစ်တွင် "မင်းကိုဉာဏ်"ကလောင်အမည်ခွဲဖြင့် ဖူးငုံဆယ်ကျော်သက် မဂ္ဂဇင်းတွင် "ဖတ်ကြည့်ပါ"(စာအုပ်အညွှန်း ကဏ္ဍ)ကို စတင်ရေးသားခဲ့သည်။

မိသားစုနှင့် အတူ သင်္ကန်းကျွန်း သာဓုခြံရှိ မိခင်၏နေအိမ်တွင် နေထိုင်၍ ဝတ္ထု၊ ကဗျာ၊ အက်ဆေး၊ ဇာတ်ညွှန်းများ ရေးသားခဲ့သည်။ ထုတ်ဝေပြီး စာအုပ်များကို ရုပ်ရှင်ဇာတ်ညွှန်းများစွာ ရိုက်ကူးခြင်းခံခဲ့ရပြီး အများစုကို ကိုယ်တိုင်ဇာတ်ညွှန်း ရေးခဲ့သည်။

''';
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static const String chitOoNyo = ''' ဆရာ ချစ်ဦးညိုကို အဖ သဘင်ပညာသည်ကြီး ဦးရွှေဒေါင်းညို၊ အမိ ဒေါ်စိန်ရင် တို့မှ ၁၉၄၇ ခုနှစ် ဒီဇင်ဘာလ ၃ဝ ရက်နေ့တွင် မန္တလေးမြို့၌ မွေးဖွား ခဲ့သည်။ အမည်ရင်း ကျော်စွာ ဖြစ်ပြီး၊ မွေးချင်း (၇) ယောက် အနက် အကြီးဆုံး ဖြစ်သည်။ ၁၉၅၂ ခုနှစ်တွင် မန္တလေးမြို့ နန်းတော်ရှေ့၊ မတ္တရာတိုက် မူလတန်းကျောင်းတွင် ပညာ ဆည်းပူးခဲ့ပြီး ၁၉၅၆တွင် မန္တလေးမြို့ ဝက်စလီကျောင်းနှင့် ဘီဘီအိုအေကျောင်းများ၌ အလယ်တန်း တက်ရောက်ခဲ့သည်။ ၁၉၅၇ ခုနှစ်တွင် မန္တလေးမြို့ မန္တလေးအထက(၁)မှ ဆယ်တန်း အောင်မြင်သည်။ ၁၉၆၂ ခုနှစ်တွင် မန္တလေးတက္ကသိုလ်၌ ဥပစာ ဝိဇ္ဇာ (က) တန်း တက်ရောက်သည်။ ၁၉၆၃-၆၈တွင် ရန်ကုန် ဝိဇ္ဇာနှင့်သိပ္ပံတက္ကသိုလ်၌ ဒဿနိကဗေဒ အဓိကဖြင့် တက်ရောက်ပြီး ၁၉၆၈တွင် ဂုဏ်ထူးသုံးဘာသာဖြင့် ဝိဇ္ဇာဘွဲ့ရခဲ့သည်။ မဟာဝိဇ္ဇာ ဆက်လက်တက်ရောက်ခဲ့သည်။

၁၉၇ဝမှစ၍ လုပ်သားများကောလိပ်၊ စစ်တွေကောလိပ်၊ ဗဟိုသမဝါယမသင်တန်းကျောင်းတို့တွင် နည်းပြဆရာအဖြစ် အမှုထမ်းခဲ့ကာ ၁၉၇၅တွင် အမှုထမ်းဘဝကို စွန့်လွှတ်ပြီးနောက် ဇာတ်အဖွဲ့ ဇာတ်ညွှန်းနှင့် ဒါရိုက်တာ၊ ကျူရှင်ဆရာ အဖြစ် ကျင်လည်ခဲ့သည်။ ၁၉၇ဝ ပြည့်နှစ် မိုးဝေစာပေ မဂ္ဂဇင်း အောက်တိုဘာလထုတ်တွင် ပထမဆုံး ပုံနှိပ်စာမူ ဖြစ်သော ရန်ကုန်မြို့ အလယ် ဝတ္ထုတိုဖြင့် စာပေနယ်သို့ ဝင်ရောက်ခဲ့သည်။ မိုးဝေစာပေမဂ္ဂဇင်းနှင့် ရှုမဝရုပ်စုံမဂ္ဂဇင်းများတွင် ဝတ္ထု၊ ဆောင်းပါး၊ ဘာသာပြန်များ ရေးသားခဲ့သည်။ ပထမဆုံး လုံးချင်းဝတ္ထုမှာ လင်္ကာဒီပချစ်သူ (၁၉၇၇) ဖြစ်ပြီး သူ၏ အထင်ရှားဆုံးဝတ္ထုလည်း ဖြစ်သည်။ သူ၏ အခြားထင်ရှားသော ဝတ္ထုများမှာ အောက်ပါအတိုင်း ဖြစ်သည်။

ချစ်သောပါဒဧကရီ (၁၉၇၉)
နှင်းကေသရာချစ်တဲ့သူရဲကောင်း (၁၉၇၉)
သုဝဏ္ဏဘုမ္မိဝေဒနာ (၁၉၈ဝ)
ခုနှစ်အိမ်တန်းက မဂျမ်းဘုံ (၁၉၈၁)
တိမ်တိမ်တွေဖုံးပါလို့ အုန်းခြိမ့်ခြိမ့်ညံ(၁၉၈၁)
ရွှေတိုက်စိုး (၁၉၈၆)
ရတနာဂီရိအကျဉ်းသား (၁၉၈၉)
မဏိစန္ဒာဥဒါန်း (၁၉၉၁)
ဘဒ္ဒါ (၁၉၉၃)
ရာဇကုမာရ (၁၉၉၃)
ရှင်စောပု (၁၉၉၆)
လောကဓံနှင့် လမ်းလျှောက်အတူထွက်ခြင်း (၁၉၉၉)
သမိုင်းမတွင်ပေမယ့် သမိုင်းဝင်နေမယ့်စကားများ(၁၉၉၉)
၁၉၇၇ ခုနှစ်တွင် ပထမဆုံး လုံးချင်း ဝတ္ထု လင်္ကာဒီပချစ်သူကို ထုတ်ဝေခဲ့သည်။ ၁၉၉၉ ခုနှစ် ဇန်နဝါရီလမှစ၍ ရန်ကုန်ယဉ်ကျေးမှုတက္ကသိုလ် ဇာတ်သဘင်ပညာဌာန အကြံပေးပုဂ္ဂိုလ်အဖြစ် ဆောင်ရွက်ခဲ့သည်။ ချစ်ဦးညိုသည် စာပေရေးသားရင်း သဘင်မဂ္ဂဇင်း စာတည်းချုပ်(၁၉၈၃-၁၉၈၈)နှင့် ရွှေပြည်တန်ဂျာနယ် စာတည်းချုပ်(၁၉၉၉-၂ဝဝဝ) အဖြစ်လုပ်ခဲ့သည်။ ၁၉၉၇တွင် တက္ကသိုလ်ဘုန်းနိုင်၏ 'သူ့ကျွန်မခံပြီ' ဝတ္ထုကို ရုပ်ရှင်ရိုက်ကူးရာ၌ ဇာတ်ညွှန်းနှင့် အနုပညာဒါရိုက်တာအဖြစ် တာဝန်ယူခဲ့သည်။ ဆရာချစ်ဦးညိုသည် စန္ဒာဦးယဉ်ကျေးမှုကဇာတ်အဖွဲ့ကိုဦးဆောင်ခဲ့ပြီး ဆရာပါရဂူရဲ့ အမ္ဗပါလီ၊ စိတ္တရလေခါဇာတ်များကို ဇာတ်ညွှန်းရေး ဒါရိုက်တာလုပ်ကာ ကိုယ်တိုင်ပါဝင် သရုပ်ဆောင်ခဲ့သည်။ ဆို၊က၊ရေး၊တီးပြိုင်ပွဲ၊ ဇာတ်သဘင်ပြိုင်ပွဲတွင် အကဲဖြတ်အဖွဲ့ခေါင်းဆောင်အဖြစ် လုပ်ဆောင်ခဲ့သည်။ ၁၉၉၈-၂ဝဝ၂ နှစ်များအတွင်းတွင် စင်ကာပူ၊ အိန္ဒိယ၊ တရုတ်၊ ထိုင်း၊ မလေးရှားနှင့် အမေရိကန်နိုင်ငံများသို့ စာပေနှင့်ယဉ်ကျေးမှု အနုပညာဆိုင်ရာ လုပ်ငန်းများအတွက် သွားရောက်ခဲ့သည်။

၁၉၉၉ ခုနှစ် ဧပြီလ၊ မေလ များတွင် အိန္ဒိယနိုင်ငံသို့ မြန်မာ ရာမာယဏ ဇာတ်အဖွဲ့ အကြံပေးပုဂ္ဂိုလ်အဖြစ် သွားရောက် ခဲ့သည်။ တစ်ဖန် ၂ဝဝဝ ပြည့်နှစ် မေလတွင် တရုတ်ပြည်သူ့သမ္မတနိုင်ငံ ၂ဝဝဝ ပြည့်နှစ် ပီကင်းပွဲတော်သို့ မြန်မာယဉ်ကျေးမှု ကဇာတ်အဖွဲ့ အကြံပေးပုဂ္ဂိုလ် အဖြစ် သွားရောက် ခဲ့သည်။ ထိုနှစ် နိုဝင်ဘာတွင် ယိုးဒယားနိုင်ငံ မဟာချူလာလောင်ကွန်တက္ကသိုလ်၏ ဖိတ်ကြားချက်အရ ဘန်ကောက်မြို့ ယင်းတက္ကသိုလ် စာပေ အနုပညာ ဌာနတွင် မြန်မာ ရာမာယဏ စာတမ်း တင်သွင်းခဲ့သည်။ ၂ဝဝ၁ ခုနှစ် စက်တင်ဘာလတွင် အမေရိကန်ကန်ပြည်ထောင်စု မြောက်အီလီနွိုက် တက္ကသိုလ်၌ ကျင်းပသည့် နိုင်ငံတကာ ရာမာယဏ ကွန်ဖရင့်သို့ တက်ရောက်ပြီး မြန်မာ ရာမာယဏ စာတမ်း (the role of yamaryana in myanmar society) တင်သွင်း ဖတ်ကြား ခဲ့သည်။ ၂ဝဝ၂ ခုနှစ် အမေရိကန်ကန်ပြည်ထောင်စု အိုဟိုင်းဝါတက္ကသိုလ်က ကျင်းပသော International Writing Program ကိုတက်ရောက်ခဲ့သည်။

၂၀၁၂ ခုတွင် ဆရာသည် ဓမ္မဒူတဆရာတော်ဦးဆေကိန္ဒ၏ မိန့်ကြားချက်အရ ၁၉၈၇ ခု ဩဂုတ်လထွက် သဘင်မဂ္ဂဇင်းတွင်ပါသော ရွာစားကြီးစိန်တင်ဟန်၏ ကိုယ်တွေ့ဆောင်းပါးကို ဘိတ်သိတ်ပြိုင်အမည်ဖြင့် ရုပ်ရှင် ရိုက်ကူးရာတွင် Screen Play ကို ရေးသားပေးခဲ့ရုံသာမက စာရေးဆရာ လယ်တွင်းသားစောချစ်၊ ကိုခင်ဇော်၊ ဘိတ်သိတ်ဆရာ တက်လူတို့နဲ့အတူ ဧည့်သည်သရုပ်ဆောင်အဖြစ်ပါဝင်ခဲ့သည်။ အင်မတန် လူကြိုက်များပြီး ယခုထက်တိုင် နာမည်ကြီးသေးသော ရုပ်ရှင် တစ်ကားလည်းဖြစ်သည်

ယခုတိုင် စာပေရေးသားခြင်း၊ ဇာတ်ညွှန်းရေးသားခြင်း လုပ်ငန်းများအပြင် မြန်မာနိုင်ငံရုပ်ရှင်အစည်းအရုံးမှာ ဒုတိယဥက္ကဋ္ဌအဖြစ်လည်းကောင်း၊ အမျိုးသားယဉ်ကျေးမှုနှင့်အနုပညာတက္ကသိုလ်(ရန်ကုန်)တွင် ပညာရေးအဖွဲ့ဝင်၊ ပြင်ပစာစစ်မှူးနှင့် ဇာတ်သဘင်ပညာဌာန အကြံပေးအဖြစ်လည်း တာဝန်ထမ်းခဲ့ဖူးပါသည်။

စာရေးသက် (၄၂)နှစ် အတွင်း ဗုဒ္ဓယဉ်ကျေးမှုနောက်ခံဝတ္ထု ၁၆ အုပ်၊ သမိုင်းနောက်ခံဝတ္ထု ၁၈ အုပ်၊ ဝတ္ထုတို ဝတ္ထုရှည်စုစည်းမှု ၈ အုပ်၊ စာပေအနုပညာအတွေးအခေါ်ဆောင်းပါး ၇ အုပ်၊ အက်ဆေးနှင့်သုတေသနစာတမ်း ၇ အုပ်၊ ခေတ်ပြိုင်အနုပညာလောကနောက်ခံ ၆ အုပ်၊ စုစုပေါင်း ၆၂ အုပ် ရေးသားထုတ်ဝေပြီး ဖြစ်သည်။[၁]''';
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static const String journalKyawMaMaLay = '''မမလေးကို ဧရာဝတီတိုင်း ဖျာပုံခရိုင် ဘိုကလေးမြို့နယ် ကမာကလူကျေးရွာ၌ အဖ ဦးပျားချို(ဒေါ်ဆင်ဘဏ်မန်နေဂျာ)၊ အမိ ဒေါ်ကွီ တို့က ၁၉၁၇ ခု ဧပြီလ ၁၃ ရက် သောကြာနေ့တွင် မွေးဖွားသည်။ မွေးချင်းငါးဦးအနက် စတုတ္ထမြောက် ဖြစ်သည်။ အမည်ရင်း မတင်လှိုင် ဖြစ်သည်။ ၁၉၂၂ ခုတွင် ဖျာပုံ အေဘီအမ် ကျောင်း၌ အစိုးရကျောင်းမှ ၁၉၂၇ ခုတွင် သတ္တမတန်းအောင်သည်။ ထို့နောက် ရန်ကုန်မြို့ မြို့မ အထက်တန်းကျောင်း ရန်ကုန် မြို့မ အမျိုးသမီးကျောင်း၌ နဝမတန်း (၁၉၃၂) အထိ ပညာသင်ကြားခဲ့သည်။ ၁၉၃၈ ခုတွင် မြန်မာ့အလင်းသတင်းစာ အယ်ဒီတာချုပ်ဦးချစ်မောင် နှင့် လက်ထပ်သည်။ ၁၉၄၆ ခု ဧပြီလ ၃ ရက်တွင် ခင်ပွန်း ဂျာနယ်ကျော် ဦးချစ်မောင် ကွယ်လွန်၍ သားနှစ်ဦးနှင့် သမီးတစ်ဦး ကျန်ရစ်ခဲ့သည်။ ၁၉၅၉ ခု မေလ ၁၄ ရက်တွင် ဦးအောင်ဇေယျနှင့် အိမ်ထောင်ပြုသည်။


ဘိုကလေးမြို့ တို့ဗမာ အစည်းအရုံးတွင် အဖွဲ့ဝင်နှင့် တက်ခေတ်အမျိုးသမီးအဖွဲ့ ဥက္ကဋ္ဌ (၁၉၃၆ - ၃၇)၊ ဂျာနယ်ကျော် ထုတ်ဝေသူ၊ ဂျာနယ်ကျော်နှင့် ပြည်သူ့ဟစ်တိုင် သတင်းစာ အယ်ဒီတာ (၁၉၃၉)၊ အမျိုးသမီးကလောင်ရှင်အသင်း ဒုတိယဥက္ကဋ္ဌနှင့် ကလောင်ရှင်မဂ္ဂဇင်း တာဝန်ခံအယ်ဒီတာ (၁၉၄၇)၊ မြန်မာနိုင်ငံ စာရေးဆရာ အသင်း ဥက္ကဋ္ဌနှင့် ကမ္ဘာ့ငြိမ်းချမ်းရေး ကွန်ဂရက် မြန်မာနိုင်ငံ ဒုတိယ ဥက္ကဋ္ဌ (၁၉၅၅)၊ မြန်မာနိုင်ငံ စာရေးဆရာ စာပေကလပ် အတွင်းရေးမှူးချုပ် (၁၉၆၁ - ၆၂) တာဝန်များကို ထမ်းဆောင်ခဲ့သည်။ တရုတ်နှင့် ဆိုဗီယက်သို့ ယဉ်ကျေးမှု ကော်မတီ အဖွဲ့ဝင် (၁၉၅၂)၊ အာရှတိုက် စာရေး ဆရာများ ကွန်ဖရင့် နယူးဒေလီ (၁၉၅၅)၊ အဏုမြူဆန့်ကျင်ရေးကွန်ဖရင့် [ဂျပန်] (၁၉၅၈)၊ ဂျပန် ဘာသာပြန် "သွေး" ဝတ္ထု အတွက် ဂုဏ်ပြုဖိတ်ကြားခြင်း ဂျပန် (၁၉၈ဝ) စသည်ဖြင့် နိုင်ငံရပ်ခြားသို့ သွားခဲ့သည်။
စာပေရေးသားပြုစုခြင်း
ပုဂ္ဂိုလ်ရေး 'ပစ်စာ' တစ်စောင်ကို တုံ့ပြန်ဆောင်းပါး ရေးရာမှ သတင်းစာတိုက်နှင့် ဆယ်သွယ်မိပြီး စာပေနယ်ထဲ ရောက်ခဲ့သည်ဆို၏။ "အမျိုးသမီးများ 'ဏကြီးသတ်' ဉာဏ် ရှိကြရန်" (မြန်မာ့အလင်း၊ ၁၉၃၆ - ၃၇) သည် ပထမပုံနှိပ်ဆောင်းပါး ဖြစ်သည်။ ပထမ ပုံနှိပ်ဝတ္ထုမှာ "မသိရလေခြင်း" [ဂျာနယ်ကျော်၊ ၃၁ - ၅ - ၁၉၄၁] ဖြစ်သည်။ ထင်ရှားသော စာအုပ်များမှာ သူမ (၁၉၄၅)၊ သူလိုလူ (၁၉၄၇)၊ သူလိုမိန်းမ (၁၉၄၈)၊ ရှုမငြီး (၁၉၄၈)၊ စိတ် (၁၉၅၁)၊ ကမ္ဘာမြေဝယ် (၁၉၅၂)၊ မုန်း၍မဟူ (၁၉၅၅)၊ တွေးတစိမ့်စိမ့် (၁၉၆၃) [လှတမျက်နှာ - ၁၉၆၉]၊ ရင်နင့်အောင်မွှေး (၁၉၆၇)၊ ရင်မှတရှိုက် (၁၉၇၉)၊ သွေး (၁၉၇၃)၊ ဂျာနယ်ကျော် မမလေး၏ ဘဝ ပုံရိပ်များ (၂ဝဝ၂) တို့ ဖြစ်ကြ၏။ မုန်း၍မဟူ ဖြင့် ၁၉၅၅ ခု စာပေဗိမာန်ဆု၊ တွေးတစိမ့်စိမ့် ဖြင့် ၁၉၆၃ ခု အနုပညာ စာပေဆု ဝတ္ထုတို ပေါင်းချုပ် တတိယဆု ရရှိ ခဲ့သည်။ နိုင်ငံခြားဘာသာသို့ ပြန်ဆိုခဲ့သည်များမှာ မြက်ကလေးတပင် (ဂျာမန် - ၁၉၆၈)၊ တွေးတစိမ့်စိမ့် (ရုရှ - ၁၉၈၄)၊ သွေး (ဂျပန် - ၁၉၇၇)၊ မုဆိုးမ (အင်္ဂလိပ်)၊ မုန်း၍မဟူ (ရုရှ၊ ဥဇဘက်၊ ပြင်သစ်၊ တရုတ်) တို့ ဖြစ်ကြသည်။


ဂျာနယ်ကျော်မမလေး၏ ကလောင်ခွဲ များမှာ ရဝေလှိုင်၊ လှတခိုင်၊ ဘိုကလေး မတင်လှိုင် တို့ဖြစ် ကြသည်။ စာရေးဆရာ၊ သတင်းစာဆရာအဖြစ်သာမက တိုင်းရင်းဆေးပညာရှင် အဖြစ်လည်း ထင်ရှား၏။ ဆေးပညာ ဆောင်းပါးများ (၁၉၆၂) (မြန်မာ့ ဆေးပညာ - ၁၉၆၇) ကို ပြုစု ခဲ့သည်။

ဘဝနိဂုံး
၁၉၈၂ ခု ဧပြီလ ၆ ရက် အင်္ဂါနေ့ နံနက် ၆:၃ဝ နာရီတွင် ရန်ကုန်မြို့ ပြည်သာယာလမ်း ဘောက်ထော် နေအိမ်၌ ကွယ်လွန်ခဲ့သည်။

 ''';
static const String TawtarSwe = '''သော်တာဆွေ[၂]သည် ကျော်ကြားသော ဟာသစာရေးဆရာတစ်ယောက်ဖြစ်သည်။ အမည်ရင်းမှာ ဦးကြင်ဆွေဖြစ်သည်။
ငယ်ဘဝ
စာရေးဆရာကြီး သော်တာဆွေကို ၁၉၁၉ ခုနှစ် မေလ ၂၆ရက် တနင်္လာနေ့တွင် ပေါင်းတည်မြို့ အလယ်ပိုင်း ကြို့ပင်ရွာနေ အဖ လယ်သမားကြီး ဦးဖိုးဆယ် အမိ ဒေါ်လှရင်တို့က ဖွားမြင်သည်။ မွေးချင်း ၈ ယောက်တွင် တတိယမြောက် ဖြစ်သည်။ ဇာတာအမည်မှာ မောင်ချစ်လှိုင် ဖြစ်ပြီး ငယ်မည်မှာ ဘိုနီ ဖြစ်သည်။ ကျောင်းနေရွယ် ကျောင်းအပ်သောအခါ မောင်ကျင်မောင် ဟူသောအမည်ဖြင့်ဖြစ်ပြီး ကြီးပြင်းလာသောအခါ မောင်ကြင်ဆွေဟု အမည်တွင်သည်။

၁၉၂၆ ခုနှစ် ၇ နှစ်သား အရွယ်တွင် ကြို့ပင်ရွာ ဘုန်းတော်ကြီးကျောင်းတွင် ဖွင့်လှစ်သည့် မြန်မာစာသက်သက်သင်သော လောကဓာတ်ကျောင်းတွင် ပညာစသင်ခဲ့ရသည်။ ၁၄ နှစ်သားအရွယ်တွင် ကြို့ပင်ရွာ ဘုန်းကြီးကျောင်းတွင်ဖွင့်သည့် အထက်တန်းကျောင်းသို့ ပြောင်းရွှေ့ ပညာသင်ကာ ၁၉၃၈ ခုနှစ်တွင် မြန်မာစာ ၁၀ တန်းအောင်ခဲ့သည်။

ရန်ကုန်မြို့ ကြည့်မြင်တိုင် ဆရာဖြစ်သင်ကျောင်းတွင် ပညာဆက်လက် သင်ယူကာ ဆရာဖြစ်သင်တန်းအောင်မြင်ခဲ့သည်။ ၁၉၃၉ ခုနှစ်တွင် ထိုခေတ်က ဟိုက်ယားဂရိတ် ခေါ် အထက်တန်း မြန်မာစာ ဆရာဖြစ် သင်တန်းအောင်ခဲ့ပြီး စမ်းချောင်း မအူပင်လမ်းရှိ ဒေါ်မမ၏ ခေတ်အင်္ဂလိပ်စာ အလွတ်ပညာသင်ကျောင်းတွင် ဆက်လက်တက်ရောက်ခဲ့သည်။ ထိုကျောင်းတွင် မောင်ကြင်ဆွေဟု အမည်ပြောင်းလိုက်သည်။ နှစ်⁠နှစ်မျှ အင်္ဂလိပ်စာ သင်ကြားခဲ့ရသည်။

အိမ်ထောင်ရေး
၁၉၄၁ ခုနှစ် ဒီဇင်ဘာလ ၂၃ ရက်နေ့တွင် ရန်ကုန်မြို့ကို ဂျပန်တို့ ဗုံးကြဲသဖြင့် ရန်ကုန်မှ ဇာတိရွာသို့ ပြန်လာခဲ့သည်။ ၁၉၄၂ ခုနှစ်တွင် ရန်ကုန်မြို့ စမ်းချောင်းမြို့နယ်မှ ဒေါ်နော်မာ နှင့် အိမ်ထောင်ကျကာ ဒေါ်ဦးဦးမေ၊ ဦးကျော်ကျော်၊ ဒေါက်တာ အောင်သော်၊ ဒေါ်မော်မော် နှင့် ဒေါ်သန်း⁠သန်းဆွေ စသည့် သားသမီးများ ထွန်းကားခဲ့သည်။

၁၉၄၂ ခုနှစ်မှ ၁၉၄၅ ခုနှစ်အထိ ဂျပန်ခေတ်တွင် မြင်းလှည်းသမားဘဝဖြင့် အသက်မွေး ကျင်လည်ခဲ့ပြီး မဟာမိတ်တို့ရန်ကုန်ကို ပြန်လည်သိမ်းပိုက်ပြီး ကက်စဘီခေတ်တွင် ကြို့ပင်ရွာသို့ ပြန်ခဲ့သည်။ ၁၉၄၆ ခုနှစ်တွင် ဖခင်၏ စီစဉ်မှုဖြင့် ပေါင်းတည်မှ မန္တလေးသို့ ဆန်ကုန်ကူးခဲ့သည်။ ထိုနောက် ကသာ၊ မြစ်ကြီးနားမြို့များအထိ ဆန်ကုန်ကူးသည်။ အရင်းပြုတ်ပြီး ကသာတွင်ပင် မသူနှင့်ထပ်မံအိမ်ထောင်ကျသည်။ ၄ လခန့် ပေါင်းသင်းပြီး ဖခင်၏ ခေါ်ဆိုမှုကြောင့် မသူနှင့် ပေါင်းတည်သို့ ပြန်လာခဲ့သည်။ မသူနှင့်အိမ်ထောင်ပြုလာခဲ့သည်ကိုသိရှိသွားသော ဖခင်က ထိုခေတ်က ငွေ ၁၀၀ ကျပ်ပေးကာ အိမ်မှ ထပ်မံနှင်ချလိုက်သည်။ ထို့နောက် မသူနှင့် ကွာရှင်းခဲ့သည်။

၁၉၅၅ တွင် ဒေါ်ခင်မေရီ (အန်တီမေ) နှင့် အိမ်ထောင်ပြုလိုက်သည်။

စာပေနယ်သို့ဝင်ရောက်ခြင်း
ငယ်စဉ်ကပင် စာ၊ ကဗျာစသည်တို့ကို ဝါသနာပါခဲ့ပြီး ကျောင်းသားဘဝကတည်းက ကဗျာများ ရေးသားခဲ့ဖူးသည်။ ဖခင်ကြီးက အိမ်ပေါ်မှ နှင်ချသည့်အခါ စိတ်အညစ်ကြီးညစ်ကာ ရှုမဝမဂ္ဂဇင်းတွင် ဟာသဝတ္ထုများ စတင်ရေးသားသည်။ ၁၉၄၇ ခုနှစ် ဩဂုတ်လတွင် ရှုမဝတွင် ပထမဆုံး စာမူပါလာသည်။ ဘရန်ဒီတစ်ပုလင်း သည် အဦးဆုံးဝတ္ထုတို ဖြစ်သည်။

ယင်းနောက် ဆရာကြီး ရွှေဥဒေါင်းနှင့်တွေ့ကာ စာများ စရေးဖြစ်ခဲ့ပြီး စုံထောက်ဝတ္ထုများ ရေးဖြစ်လာသည်။ ရှုမဝမှ အပါယ်ရတနာ (၁၉၄၇)၊ ရန်အောင် ရတနာ (၁၉၄၈) စသော စာအုပ်များ ထွက်ခဲ့သည်။ နောက်ပိုင်းတွင် အခြား စာစောင်မဂ္ဂဇင်းများတွင် ကူးပြောင်း ရေးသားခဲ့သည်။ ရှုမဝ စာအုပ်တိုက်မှ ဆရာသော်တာဆွေ၏ စာအုပ်များ ဆက်ထွက်လာသည်။ ၁၉၅၉ ခုနှစ်တွင် အဟိ လစဉ် ဟာသမဂ္ဂဇင်းကို ကိုယ်တိုင်စတင် တည်းဖြတ်ထုတ်ဝေသည်။ သော်တာစာပေ အမည်ဖြစ် စာအုပ်ထုတ်ဝေရေး လုပ်ငန်းကို လုပ်ကိုင်ခဲ့သည်။


ဆရာသော်တာဆွေ ရေးသားကျော်ကြားခဲ့သော စာအုပ်များ အနက်မှ “ကျွန်တော့်ဘဝဇာတ်ကြောင်း” အမည်ရှိ အခန်းဆက် ဝတ္ထုရှည်
စာပေခရီး
၁၉၆၁ ခုနှစ်တွင် “ဘဝထိုထို” စာအုပ်ဖြင့် စာပေဗိမာန် ဝတ္ထုတိုပေါင်းချုပ် ဒုတိယဆုကို ရရှိခဲ့သည်။ ၁၉၆၃ ခုနှစ်တွင် ဆိုဗီယက်ယူနီယံနှင့် အရှေ့ဂျာမနီ နိုင်ငံများသို့ စာပေလေ့လာရေး ခရီးသွားခွင့် ရခဲ့သည်။ ၁၉၆၄ ခုနှစ်တွင် “သတ္တဝါတို့၏ သံသရာ” စာအုပ်ဖြင့် အနုပညာစာပေ ဝတ္ထုတိုပေါင်းချုပ်ဆုကို ရရှိခဲ့သည်။ ၁၉၇၁ ခုနှစ်တွင် အဟိ မဂ္ဂဇင်း ရပ်ဆိုင်းသွားသည်။ လုံးချင်းစာအုပ်များ ဆက်လက်ရေးသား ထွက်ရှိခဲ့သည်။

ဘဝနိဂုံး
၁၉⁠၉၅ ခုနှစ် မတ်လ ၄ ရက်နေ့တွင် ရန်ကုန်မြို့ အမှတ် (၂) တပ်မတော်ဆေးရုံကြီးတွင် အာရုံကြောရောဂါဖြင့် ကွယ်လွန်ခဲ့သည်။ ပထမအိမ်​ထောင်မှ သားနှစ်ဦး သမီးသုံးဦး တတိယ အိမ်ထောင်နှင့် သားသမီးမရရှိခဲ့ပါ

ရေးသားခဲ့ပြီး ထင်ရှားသည့် စာအုပ်များ
ဆရာသော်တာဆွေ ရေးသားခဲ့ပြီး ထင်ရှားသည့် စာအုပ်များမှာ ကျွန်တော့်ဘဝဇာတ်ကြောင်း အတွဲများ၊ ကြက်ဋီကာ (၁၉၇၉)၊ မဟာစံအိမ်တော်ကြီး (၁၉၇၆)၊ ဘွန္တော ကြက်သူခိုး (၁၉၇၂)၊ ပုဂံ သူရဲကောင်းများ (ဒေါ်ခင်မျိုးချစ် အင်္ဂလိပ်လိုရေးသားသည်ကို မြန်မာပြန်၊ ၁၉၇၃)၊ ဟာသ ဝတ္ထုတိုများ (အတွဲ ၁၊ ၂၊ ၁၉၇၇ နှင့် ၁၉၇၈)၊ ဘဝထိုထို (၁၉၆၁)၊ သတ္တဝါတို့ သံသရာ (၁၉၆၄)၊ ဤလောက မြေမဟီဝယ် (၁၉၇၀)၊ ရသ ဝတ္ထုတိုပေါင်းချုပ်သစ် (၂၀⁠၀၀ ပြည့်နှစ်) နှင့် လောကလူ့ပြည် (၁၉၇၂) တို့ ဖြစ်ကြသည်။
 
 ကလောင်အမည်ကွဲများ
မိုးတိမ်တောင်(ပထမဆုံးကလောင်အမည်)
ဦ:ကြင်ဆွေ
ဝေလင်း
အောင်နက်
 ''';
 //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 /////////////////////////////////////////////////////////////////////////////////////////////
 static const String khinkhinHtoo = ''' ခင်ခင်ထူး [၁]သည် မြန်မာအမျိုးသမီး စာရေးဆရာတစ်ဦးဖြစ်ကာ ဝတ္ထုတို၊ ဝတ္ထုရှည် များစွာရေးသား ထုတ်ဝေထား၍ အမျိုးသား စာပေဆု ရရှိထားသော သူလည်းဖြစ်သည်။ကျေးလက်နောက်ခံ အချစ်ဝတ္ထုများကို ရိုးရာအတွေးများဖြင့် ဖော်ကျူးရေးတတ်သူ၊ မအိမ်ကံ အခန်းဆက် ဝတ္ထုရှည်ကနေ ပရိသတ်ကြား ပေါက်သွားခဲ့သူဟု ဘီဘီစီသတင်းက ဖော်ပြသည်။
 
 ဘဝအကျဉ်း
ပြင်ဆင်
၁၉၆၅ ဒီဇင်ဘာ(၁၇)ရက်နေ့တွင် မြင်းခြံမြို့၌ အဖ-ဦးညို၊ အမိ-ဒေါ်မြတင်တို့က မွေးဖွားသည်။ မွေးချင်း(၆)ယောက်တွင် တတိယမြောက် တစ်ဦးတည်းသော သမီးဖြစ်သည်။ အမည်ရင်းမှာ ဒေါ်ထူးထူး ပင်ဖြစ်သည်။ ငယ်စဉ်က မြင်းခြံမြို့တွင် ပညာသင်ကြားခဲ့သည်။

၁၉၈၅၌ မန္တလေးတက္ကသိုလ်မှ ဓာတုဗေဒဘာသာရပ်ဖြင့် ဘွဲ့ရရှိခဲ့ကာ ၁၉၈၉တွင် မူလတန်းပြဆရာမအဖြစ် တာဝန်ထမ်းဆောင်ခဲ့သည်။ ၁၉၉ဝပြည့်နှစ်တွင် အလယ်တန်းပြဆရာမဖြစ်လာကာ ၁၉၉၂၌ မန္တလေးသို့ ပြောင်းရွှေ့ခဲ့သည်။ ဧပြီလထုတ် ရွှေဝတ်မှုန် မဂ္ဂဇင်းတွင် ပါရှိသော ပန်းပန်ပါရစေ ဝတ္ထုတိုဖြင့် စာပေနယ်သို့ စတင်ဝင်ရောက်ခဲ့ သည်။

၁၉၉၃မှစ၍ မဂ္ဂဇင်းများတွင် ဝတ္ထုတို၊ ဝတ္ထုရှည်များရေးသားကာ အားကစားဂျာနယ်များတွင်လည်း ဘောလုံးဆောင်းပါးများ ရေးသားခဲ့၏ ။ အချို့ဝတ္ထုတိုများကို ဂျပန်ဘာသာ၊ ဂျာမန်ဘာသာသို့ ပြန်ဆိုခဲ့ကြသည်။ ၁၉၉၉တွင် မဂ္ဂဇင်းပါဝတ္ထုတိုများကို စုစည်းလျှက် သနပ်ခါး ဝတ္ထုတိုများထွက်ရှိခဲ့ကာ သူမ၏ ပထမဆုံး လုံးချင်းစာအုပ်ဖြစ်သည်။

၂၀၀၁ ရောက်သောအခါ အလယ်တန်းပြဆရာမအဖြစ်မှ နုတ်ထွက်၍ နောင်တစ်နှစ်တွင် 'ကျမချစ်သော ဘောလုံးသူရဲကောင်းများ' (စတားပလေယာကောက်ကြောင်း) စာအုပ်ထွက်ခဲ့သည်။ စာရေးဆရာ နေဝင်းမြင့် နှင့် အိမ်ထောင်ပြုခဲ့သည်။ ၂၀၀၃၌ ဖက်စိမ်းကွမ်းတောင်ရွှေဝတ္ထုတိုများ ဖြင့် အမျိုးသားစာပေ ဝတ္ထုတိုပေါင်းချုပ်ဆုရရှိခဲ့သည်။

စာနယ်ဇင်းများတွင် ဝတ္ထုတို၊ ဝတ္ထုရှည်၊ ဆောင်းပါးများ အပုဒ်(၁၀၀)ကျော်ရေးသားခဲ့ပြီး ဖြစ်လေသည်။


ဆုတံဆိပ်များ
ပြင်ဆင်
၂၀၀၃တွင် အမျိုးသားစာပေဆုကို ဖက်စိမ်းကွမ်းတောင်ရွှေဝတ္ထုတိုများ ဖြင့်ရရှိခဲ့သည်။

 ''';
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////
 static const String thaKathoBoneNaing = '''တက္ကသိုလ် ဘုန်းနိုင် (၁၉၃ဝ-၂ဝဝ၂) သည် မြန်မာနိုင်ငံသား တက္ကသိုလ် ပါမောက္ခ/ပါမောက္ခချုပ် တစ်ဦး အဖြစ်တာဝန်ထမ်းဆောင်ခဲ့သူ ဖြစ်ပြီး အမျိုးသား စာပေဆုရ စာရေးဆရာ၊ ဇာတ်ညွှန်းရေးဆရာ၊ တေးရေးဆရာလည်း ဖြစ်ခဲ့သည်။
 
 ငယ်စဉ်ဘဝ နှင့် ပညာရေး
ရန်ကုန်တိုင်း သန်လျင်မြို့၌ အဖ ဦးထွန်းဖေ၊ အမိ ဒေါ်ကြင်မေ တို့က ၁၆ ဇန်နဝါရီ ၁၉၃ဝ ကြာသပတေးနေ့တွင် မွေးဖွားခဲ့သည်။ မွေးချင်းငါးယောက်တွင် ဒုတိယမြောက် ဖြစ်သည်။ ငယ်မည် မောင်ဖေသိန်း၊ အမည်ရင်းမှာ ဦးခင်မောင်တင့် ဖြစ်သည်။

ပြည်ခရိုင် ပေါင်းတည်မြို့ မူလတန်းလွန်ကျောင်းမှ တက္ကသိုလ်ဝင်စာမေးပွဲ အောင်မြင်ပြီး မက်သဒစ်ကျောင်းများ (သန်လျင်၊ တွံတေး၊ သုံးခွ)၊ အစိုးရ အထက်တန်းကျောင်းများ (ပြည်၊ ပေါင်းတည်)၊ ဗုဒ္ဓဘာသာစာပေကို ကိုးတောင်တွဲကျောင်း (ထုံးဘို)၊ တက္ကသိုလ်ဝင် စာမေးပွဲ (၁၉၄၈)၊ ရန်ကုန် တက္ကသိုလ် (၁၉၄၈)၊ စိတ်ပညာ ဝိဇ္ဇာ ဂုဏ်ထူးဘွဲ့ (၁၉၅၅)၊ အမေရိကန် ပြည်ထောင်စု၊ နယူးယောက်မြို့၊ ကိုလံဘီယာ တက္ကသိုလ် ဘွဲ့လွန် မဟာ ဌာနမှ မဟာ ဝိဇ္ဇာဘွဲ့ (၁၉၅၉ - ၆၁) တို့ကို ဆည်းပူး အောင်မြင်ခဲ့သည်။

နိုင်ငံ့ဝန်ထမ်း
၁၉၄၈ ခုနှစ်တွင် ရန်ကုန်တက္ကသိုလ်သို့ ရောက်ခဲ့သည်။ ရန်ကုန်တက္ကသိုလ်ဂုဏ်ထူးတန်း နောက်ဆုံးနှစ် ဓာတ်ခွဲခန်းတွင် လက်တွေ့လုပ်နေစဉ် မန္တလေးတက္ကသိုလ်ကောလိပ် ကျောင်းအုပ်ကြီး ဦးကိုလေးက မန္တလေးတက္ကသိုလ်သို့ လာရောက်၍ စိတ်ပညာ စတင်သင်ကြားပေးရန် မေတ္တာရပ်ခံခဲ့သည်။ မိမိ၏ ပညာပြန့်ပွားသည်ကို နှစ်သက်သည်က တစ်ကြောင်း၊ ဆရာကြီးဦးကိုလေးအား လေးစားသည်ကတစ်ကြောင်းကြောင့် လာပါမည်ဟု ကတိပေးခဲ့သည်။

မန္တလေး ယူနီဗာစီတီ ကောလိပ် စိတ်ပညာ ဌာနမှူး (၁၉၅၅)၊ တောင်ကြီးကောလိပ် ကျောင်းအုပ်ကြီး (၁၉၆၂ - ၇၂)၊ ပုသိမ် ဒီဂရီ ကောလိပ် ကျောင်းအုပ်ကြီး (၁၉၇၂ - ၇၇)၊ မော်လမြိုင် ဒီဂရီ ကောလိပ် ကျောင်းအုပ်ကြီး (၁၉၇၇ - ၈၅)၊ မော်လမြိုင် တက္ကသိုလ် ဒုတိယ ပါမောက္ခချုပ် (၁၉၈၆ - ၈၈)အဖြစ်တာဝန်ထမ်းဆောင်ခဲ့သည်။ ပညာရေး တက္ကသိုလ် ပါမောက္ခချုပ် အဖြစ်တာဝန်ထမ်းဆောင်နေစဉ် ၁၉၈၈အရေးအခင်း၌ စစ်မှန်သောဒီမိုကရေစီကို တောင်းဆိုရာတွင် ပါဝင်ခဲ့မှုကြောင့် စစ်အာဏာပိုင်များက အငြိမ်းစားပေးခြင်းခံခဲ့ရသည်။

မြန်မာပညာရေး လေ့လာရေး အဖွဲ့ ခေါင်းဆောင် အဖြစ် ဂျပန် (၁၉၇၇) နှင့် တရုတ် (၁၉၈၃) သို့ လည်းကောင်း၊ မြန်မာပညာရေး အထူး လေ့လာရေး အဖွဲ့ ဒုတိယ ခေါင်းဆောင် အဖြစ် ဂျပန် (၁၉၈၁) သို့ လည်းကောင်း၊ အာဆီယံ - ကိုရီးယား ယဉ်ကျေးမှု ခေါင်းဆောင် ဖလှယ်ရေး အစီအစဉ် တွေ့ဆုံ ပွဲများတွင် မြန်မာ ကိုယ်စားလှယ် အဖွဲ့ဝင် အဖြစ် ၁၉၉၉ နှင့် ၂ဝဝဝ ပြည့်နှစ်များ၌ ကိုးရီးယား သမ္မတ နိုင်ငံသို့ သွားရောက် ခဲ့ပြီး စာတမ်းများ ပြုစု ဖတ်ကြား ခဲ့သည်။

စာပေရေးသားခြင်း
စာပေနယ်သို့ ရှုမဝ မဂ္ဂဇင်း ပါ "ဒွိဟ" ကဗျာဖြင့် ၁၉၄၉ ခုနှစ်တွင် စတင် ဝင်ရောက် ခဲ့သည်။ ထင်ရှားသည့် လုံးချင်း ဝတ္ထုရှည်အချို့မှာ၊ ညီမလေးရယ် စိုးရိမ်မိတယ် (၁၉၅၈)၊ သူ့ကျွန်မခံပြီ (၁၉၅၉)၊ လွမ်း (၁၉၆၂)၊ မိုးည အိပ်မက်မြူ (၁၉၆၂)၊ ဤမြေမှသည် (၁၉၆၃)၊ စိမ်းနေဦးမည့် ကျွန်တော့်မြေ (၁၉၆၃)၊ မောင့်ဘဝ ညအလားကွယ် (၁၉၆၃)၊ သူငယ်ချင်းလို့ပဲ ဆက်၍ခေါ်မည် ခိုင် (၁၉၆၄)၊ ချစ်သော ဤကမ္ဘာ (၁၉၆၄)၊ လွမ်းတေး မဆုံးစေနှင့် စောသခင် (၁၉၆၅)၊ ကမ္ဘာကုန် ကျယ်သရွေ့ဝယ် (၁၉၆၆)၊ နွေကန္တာဦး (၁၉၆၈)၊ ဝသန် လေချိန်မှန်ကူး (၁၉၆၉)၊ တပြည်သူ မရွှေထား (၁၉၇၁)၊ နှင်းငွေ့တထောင့် မိုးတမှောင့် (၁၉၇၂)၊ ကိုယ့်အလှ ဘဝငွေလမင်း (၁၉၇၆)၊ စွန့်ခွာရသည့် နွေညများ (၁၉၈ဝ)၊ မိုးတွေ ရွာမှဖြင့် လျှင်ကွယ် (၁၉၈၄)၊ တိမ်ညိုအလွင့် လအမြင့် (၁၉၉ဝ)၊ ချစ်သူအိမ်အမိုး နောက်ဝယ် လပျောက်ခဲ့ခြင်း (၁၉၉၁)၊ မျက်ရည် လောကများ၏ ဟိုမှာဘက် (၁၉၉၂)၊ လေရူးသည် စာမတတ်ပါ (၁၉၉၅)စသည်တို့ ဖြစ်ကြသည်။ ထင်ရှားသည့် မဂ္ဂဇင်း ဝတ္ထုရှည် (novelette) များမှာ နှင်းရွက်ကြွေစော (၁၉၅၈)၊ မုန်းရစ်လေဦး (၁၉၅၈)၊ ရေပင်လယ်နှင် ငွေစင်ကြယ် (၁၉၅၈)၊ တန်ခူးလေနှင့် လျောတော့သည် (၁၉၆၁)၊ ပိတောက်နှင့် ကြိုပါမည် မာရီယာ (၁၉၆၃)၊ ကရုဏာ မိခင် (၁၉၆၃) တို့ ဖြစ်ကြသည်။ ဝတ္ထုတို အများ ကိုလည်း ရေးသားခဲ့ရာ ယင်းတို့ကို ပြန်လည် တင်ပြသည် (၁၉၆၅)၊ ဝတ္ထုတို ပေါင်းချုပ် အမှတ် ၁၊ ၂၊ ၃ (၁၉၆၉)၊ ဝိညာဉ်မှာ ဖူးသည့် ကြည်နူးမှု အလှပန်း (၁၉၉၃)၊ ကျွန်တော့် ဘဝ ပိတောက်ကမ္ဘာ (၁၉၉၃) စသည်ဖြင့် စုစည်း ခဲ့သည်။ စာပေ အနုပညာ ဆိုင်ရာ ကျမ်းများမှာ ဘုန်းနိုင့် အတွေး ဘုန်းနိုင့် အမြင် (၁၉၇၇)၊ ခမ်သိမ်းကလျာ ရှုဖွယ်သာတည်း ပထမတွဲ၊ ဒုတိယတွဲ (၁၉၉၄) တို့ ဖြစ်ကြသည်။ အင်္ဂလိပ် - မြန်မာ နှစ်ဘာသာ ဘာသာပြန် ကဗျာ စာအုပ် များမှာ ရှားလော့ဒေဝီ (၁၉၉၆)၊ တမ်းတမိခြင်း (၁၉၉၇) တို့ ဖြစ်ကြသည်။

နိုင်ငံခြား ဘာသာသို့ ပြန်ဆို ထုတ်ဝေ ခဲ့သည့် စာအုပ်များမှာ ရုရှား ဘာသာဖြင့် 'သူ့ကျွန်မခံပြီ' (၁၉၇ဝ)၊ တရုတ် ဘာသာဖြင့် 'စွန့်ခွာရသည့် နွေညများ' (၁၉၈၈)၊ ဟင်ဒီ ဘာသာဖြင့် 'သူငယ်ချင်းလို့ပဲ ဆက်၍ခေါ်မည် ခိုင်' (၁၉၉၄) တို့ ဖြစ်ကြသည်။ 'နှင်းငွေ့ တထောင့် မိုးတမှောင့်' ဖြင့် ၁၉၇၂ ခုနှစ်တွင် အမျိုးသား စာပေဆု ရရှိခဲ့သည်။[၁]

ကွယ်လွန်
၂ဝဝ၂ ခုနှစ် မေလ ၁ဝ ရက်နေ့တွင် သန်လျင်၌ ကွယ်လွန် ခဲ့သည်။


  ''';
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  static const String myaThanThint = '''မြသန်းတင့် (၂၃ မေ ၁၉၂၉ - ၁၈ ဖေဖော်ဝါရီ ၁၉၉၈) သည် ဗမာလူမျိုး စာရေးဆရာနှင့် ဘာသာပြန်ဆိုရေးသားသူတဦး ဖြစ်သည်။ မြသန်းတင့်သည် မြန်မာစာပေလောကအပေါ်တွင် ဩဇာအရှိဆုံးစာရေးဆရာများထဲက တစ်ယောက်ဖြစ်ပြီး သူ၏ စာပေဖြတ်သန်းမှု၊ စာပေရေးသားမှုနှင့် ပတ်သက်၍ နှောင်းလူတို့ ပြောစမှတ်တွင်လျက်ရှိသည်။ ကမ္ဘာ့ဂန္ထဝင်စာပေများကို စဉ်ဆက်မပြတ် ပြန်ဆိုရေးသားသူအဖြစ် နာမည်ကျော်ကြားခဲ့သူလည်း ဖြစ်သည်။
  
  ကိုယ်ရေးရာဇဝင်
ဦးမြသန်း ခေါ် စာရေးဆရာမြသန်းတင့်ကို အဘ ဦးပေါတင့်၊ အမိ ဒေါ်လှိုင်တို့က ပခုက္ကူခရိုင်၊ မြိုင်မြို့တွင် ၁၉၂၉ ခုနှစ်၊ မေလ ၂၃ ရက်၊ ကြာသပတေးနေ့၌ မွေးဖွားသည်။ မွေးချင်းခုနစ်ယောက်တွင် အကြီးဆုံးဖြစ်သည်။

ငယ်စဉ် ၁၉၄၃ခုနှစ်တွင် အာရှလူငယ်အဖွဲ့၌တက်ကြွစွာ ပါဝင်ခဲ့သည်။ ၁၉၄၄-ခုနှစ်တွင် ဖက်ဆစ်တော်လှန်ရေး မြေအောက်ကလာပ်စည်းများနှင့် ဆက်သွယ်၍ ဖက်ဆစ်တော် လှန်ရေးကြီးတွင် ပါဝင်ခဲ့သည်။ ဂျပန်တော်လှန်ရေးကာလအတွင်း စစ်ကိုင်းရှိ ဗိုလ်သန်းဦး(တော်လှန်ရေးတွင် ကျဆုံး)၊ သခင်မောင်တင်(ပြည်တွင်းစစ်တွင် ကျဆုံး) နှင့် မြိုင်မြို့ ဘုန်းတော်ကြီး ဦးစရိယ (မြိုင်ဖဆပလအမတ်ဟောင်း ဦးသက်ရှည်)တို့၏ ဦးဆောင်မှုအောက်တွင် ပါဝင်လှုပ်ရှားခဲ့သည်။ ဒုတိယကမ္ဘာစစ်ကြီးအပြီး မန္တလေးခရိုင်၊ အထက်မြန်မာပြည် ဖဆပလအဖွဲ့ချုပ်တွင် အချိန်ပြည့် တာဝန်ထမ်းဆောင်ခဲ့သည်။

၁၉၄၈-ခုနှစ်တွင် ရန်ကုန်တက္ကသိုလ်သို့ တက်ရောက်သည်။ ၁၉၅၄-ခုနှစ်တွင် ဝိဇ္ဇာဘွဲ့နှင့် ၁၉၅၆-ခုနှစ်တွင် ဥပဒေဘွဲ့တို့ကို ရရှိခဲ့သည်။

ကျောက်ပန်းတောင်းတွင် အက်တူး သခင်အုန်းဖေ (ပြည်တွင်းစစ်တွင်ကျဆုံး) နှင့်အတူ လယ်သမားများ သီးစားခ မပေးရေး တိုက်ပွဲ၊ လက်ငုတ်လယ်ပြန်ထွန်ရေးတိုက်ပွဲ၊ မြေရှင်ကြီးများ၏လယ်များကို အတင်းဝင်ထွန်ရေး တိုက်ပွဲများကို ဦးဆောင်ခဲ့သည်။ သီးစားခမပေးရေး တိုက်ပွဲတွင် အင်္ဂလိပ် အစိုးရသိမ်းယူထားသော လယ်သမားများ၏ပစ္စည်းများကို ပြန်လည်လုယူသည့်အတွက် (ရုံးမင်းတစ်ထိုင်) အပြစ်ဒဏ်ကျခြင်း ခံခဲ့ရသည်။ မြင်းခြံခရိုင်တွင် တခြားသော ခေါင်းဆောင်များနှင့်အတူ မြသန်းတင့်ခေါင်းကို ဖြတ်နိုင်လျှင် ဆုငွေပေးမည်ဟု အင်္ဂလိပ်အလိုတော်ရိနှင့် မြေရှင်တို့က တိတ်တဆိတ် ဆုငွေထုတ်ခဲ့သည်။ အထွေထွေသပိတ်ကြီးတွင် မြင်းခြံ၊ မန္တလေး၊ ဒလသင်္ဘောကျင်း အလုပ်သမားထုကြီး ပါဝင်ရေးအတွက် တာဝန်ယူခဲ့သည်။ မြင်းခြံခရိုင် အလုပ်သမားသမဂ္ဂနှင့် လယ်သမားသမဂ္ဂတို့တွင် အလုပ်အမှုဆောင်အဖြစ်ဆောင်ရွက်ရင်း ဖြူးမြို့တွင်ကျင်းပသည့် မြန်မာနိုင်ငံလုံးဆိုင်ရာဖြူးလယ်သမား ကွန်ဂရက်ကြီးသို့ မြင်းခြံခရိုင် ကိုယ်စားလှယ်အဖြစ် တက်ရောက်ခဲ့သည်။

၁၉၄၉-ခုနှစ်တွင် ပထမဆုံးရေးသည့် 'ဒုက္ခသည်' ဝတ္ထုကို တာရာမဂ္ဂဇင်း (အတွဲ-၃၊ အမှတ် ၂၁)တွင် ပုံနှိပ် ဖော်ပြခြင်းခံရသည်။ ၁၉၅ဝ-ပြည့်နှစ်တွင် စာပေသည် ပြည်သူ့ အတွက်ဟူသော ကြွေးကြော်သံဖြင့် 'စာပေမဂ္ဂဇင်း'ကို ကိုသန်းတင့်၊ ဒဂုန်တာရာ၊ မောင်ကြည်လင်၊ အောင်လင်း၊ ကျော်အောင်တို့နှင့်အတူ ဦးဆောင်ထုတ်ဝေခဲ့သည်။ ၁၉၅၁-ခုနှစ် တွင် ဂေါ်ကီ၏ 'မာလိဖောနှင့်အခြားဝတ္ထုတိုများ'ကို ပထမဆုံး ဘာသာပြန်ဆို ရေးသားထုတ်ဝေခဲ့သည်။

၁၉၅၂-ခုနှစ်တွင် ကမ္ဘာ့ငြိမ်းချမ်းရေးကွန်ဂရက် (မြန်မာနိုင်ငံ) နှင့် မြန်မာနိုင်ငံစာရေးဆရာများအသင်း အလုပ်အမှုဆောင်အဖြစ် ဆောင်ရွက်ခဲ့ပြီး စာရေးဆရာအသင်းမှ ထုတ်ဝေသော 'စာပေမဂ္ဂဇင်း' တွင် တာဝန်ခံအယ်ဒီတာ အဖြစ်၎င်း၊ 'ပြည်တော်သစ်ဂျာနယ်'တွင် အယ်ဒီတာချုပ်အဖြစ်၎င်း၊ 'တိုးတက်ရေးသတင်းစာ'တွင် နိုင်ငံခြားရေးအယ်ဒီတာအဖြစ်၎င်း ဆောင်ရွက်ခဲ့သည်။ ထိုနှစ်မှာပင် ဂေါ်ကီ၏အတ္ထုပ္ပတ္တိ 'ဂေါ်ကီ'ကို ဒုတိယမြောက် ဘာသာပြန်လက်ရာအဖြစ် ထုတ်ဝေခဲ့သည်။

၁၉၅၃-ခုနှစ်တွင် ပင်ကိုရေး လုံးချင်းဝတ္ထုအဖြစ် 'မေတ္တာအသင်္ချေ'ကို ရေးသားခဲ့သည်။

၁၉၅၅-ခုနှစ်က သခင်ကိုယ်တော်မှိုင်း ဦးဆောင်သော ပြည်တွင်းငြိမ်းချမ်းရေး ဗဟိုကော်မတီတွင် အတွင်းရေးမှူးအဖြစ် ဆောင်ရွက်ခဲ့ပြီး ၁၉၅၇-ခုနှစ်တွင် ကမ္ဘာ့ငြိမ်းချမ်းရေး ကွန်ဂရက် (မြန်မာနိုင်ငံ) အတွင်းရေးမှူးချုပ်နှင့် ဩစတြီးယားနိုင်ငံ၊ ဗီယင်နာမြို့တွင် ဌာနချုပ်တည်ရှိသည့် 'ကမ္ဘာ့ငြိမ်းချမ်းရေးကောင်စီ'၏ ဗျူရိုအဖွဲ့ဝင် လူကြီးဖြစ်ခဲ့သည်။

၁၉၆ဝ-ပြည့်နှစ်တွင် ရေးသားသော 'နွံထဲကကြာ' ဝတ္ထုမှစ၍ ကလောင်အမည် ကိုမြသန်းမှ မြသန်းတင့်သို့ ပြောင်းခဲ့သည်။ ထိုဝတ္ထုကို စာရေးဆရာ သိန်းဖေမြင့်နှင့် ပူးတွဲရေးသား၍ ဗိုလ်တထောင်သတင်းစာတွင် အခန်းဆက် ဖော်ပြရာ နှစ်နှစ်နီးပါး ဖော်ပြခဲ့ရသည်။

၁၉၆၁-ခုနှစ်တွင် ဆွီဒင်နိုင်ငံ၊ စကော့ဟုမ်းမြို့တွင် ကျင်းပသော ငြိမ်းချမ်းရေးကောင်စီ အစည်းအဝေးသို့ ကမ္ဘာ့ ငြိမ်းချမ်းရေးကွန်ဂရက် (မြန်မာနိုင်ငံ)၏ ကိုယ်စားလှယ် အဖြစ် တက်ရောက်ခဲ့သည်။ ညီလာခံမှအပြန် ဆိုဗီယက်ယူနီယံနှင့် တရုတ်ပြည်သူ့သမ္မတနိုင်ငံ ငြိမ်းချမ်းရေးကော်မတီများ ၏ဖိတ်ကြားချက်အရ ဒဂုန်တာရာ၊ ပါမောက္ခဦးအောင်လှတို့ နှင့်အတူ သွားရောက်ခဲ့သည်။

မြသန်းတင့်၏ထင်ရှားသော ပင်ကိုရေးဝတ္ထုများမှာ မေတ္တာအသင်္ချေ၊ လိုက်ခဲ့တော့မြနန္ဒာ၊ အမှောင်ရိပ်ဝယ်၊ ဆယ်ကြိမ်မြောက် အလည်ရောက်ခြင်း၊ နှင်းနု၊ မမ၊ နွံထဲက ကြာ၊ ထားကျွန်မလင်၊ ဓားတောင်ကိုကျော်၍ မီးပင်လယ်ကို ဖြတ်မည်၊ လေညင်းနှင့်လရောင် တို့ဖြစ်ပြီး နေထွက်သောည (ပြဇာတ်)ကိုလည်း ရေးသားခဲ့သည်။

စာပေဝေဖန်ရေးအဖြစ် 'ကျွန်တော် ဆက်၍ ရေးချင်သော ဝတ္ထုများ'နှင့် 'မြန်မာကျေးတောနေတို့၏ ကဗျာများ'၊ ခရီးသွားဆောင်းပါးအဖြစ် 'အရှေ့လေတိုက်သော အခါ' ၊ ' ငွေသောင်ယံ၊ ဟွန်ဒါယဉ်ကျေးမှု၊ မေရီဗိုဗေးနှင့် အီကွေတာညများ' စသည်တို့ကို ရေးသားခဲ့သည်။

ဘာသာပြန်လက်ရာများမှာ အထူး ထင်ရှားခဲ့ရာ နိုင်ငံရေးစာအုပ် ခြောက်အုပ်၊ အတ္ထုပ္ပတ္တိ တစ်အုပ်၊ သမိုင်း၊ ဒဿနိကဗေဒနှင့် အထွေထွေ ၁၄ အုပ်၊ ဝတ္ထု၃ဝ ကျော် ပြန်ဆိုခဲ့သည်။ ဘာသာပြန်များတွင် ပါရီကျဆုံးခန်း၊ ရွှေပြည်တော် မျှော်တိုင်းဝေး၊ ချစ်သောယွန်းခင်ခင် စသည်တို့မှာလည်း ထင်ရှားခဲ့သည်။ နိုင်ငံတကာ ကဗျာများကိုလည်း ဘာသာပြန် ရေးသားခဲ့ရာ ရာဗင်ဒြာနတ်တဂိုး၏ကဗျာများအပါအဝင် စုစုပေါင်း ၁၄ အုပ်မျှ ထုတ်ဝေခဲ့သည်။

ဗြိတိသျှတို့ထံမှ မြန်မာနိုင်ငံလွတ်လပ်ရေးရရှိခဲ့သော ၁၉၄၈-ခုနှစ်တွင် မြသန်းတင့် သည် ရန်ကုန်တက္ကသိုလ်တွင် ပညာဆည်းပူးခဲ့ပြီးနောက် ဒဿနိက၊ နိုင်ငံရေးသိပ္ပံနှင့် အင်္ဂလိပ် အနုစာပေ စသော ဘာသာရပ်များဖြင့် ဘွဲ့ရရှိခဲ့သည်။ တာရာ မဂ္ဂဇင်း (အမှတ်စဉ် ၂၁၊ အတွဲ ၃၊ ၁၉၄၉) ၌ “ဒုက္ခသည်” ဟူသော သူ၏ ပထမဦးဆုံး ဝတ္ထုတိုဖြင့် မြသန်းတင့်သည် စာပေနယ်သို့ ၁၉၄၉-တွင် စတင်ဝင်ရောက် ခဲ့ပြီး သူ၏ စာရေးသက်အနှစ် ၅၀ အတွင်း ဝတ္ထုတိုနှင့် ဝတ္ထုရှည်များ၊ မှတ်တမ်းမှတ်ရာ များစွာ နှင့် ဘာသာပြန် ဆိုရေးသား မှုများကို ရေးသားထုတ်ဝေခဲ့သည်။ ၁၉၇၃ တွင် ရေးသားခဲ့သော ဓားတောင်ကိုကျော်၍ မီးပင်လယ်ကို ဖြတ်မည် ဟူသော ဝတ္ထု သည် သူ၏ အကြီးကျယ်ဆုံး သော ပြောင်မြောက်သည့်လက်ရာဟုယူဆပြီး သူသည် “တောင်သမန် ရွှေအင်းကလေညင်းဆော်တော့” ကဲ့သို့သော သမိုင်းဆိုင်ရာ မှတ်တမ်းမှတ်ရာ များကိုပါ ရေးသားခဲ့သည်။ အနောက်တိုင်း စာပေများစွာကို မြန်မာဘာသာသို့ အရေးသွက်သွက်ဖြင့် ဘာသာပြန်ဆို ရေး သားသူဖြစ်သည့်အလျောက် မြသန်းတင့်သည် စစ်နှင့်ငြိမ်းချမ်းရေး၊ လေရူးသုန်သုန်၊ ခန်းဆောင်နီ အိပ်မက် ကဲ့သို့သော ကမ္ဘာ့ဂန္ထဝင်စာအုပ်များနှင့်သူ၏ စာဖတ်ပရိသတ် များကို မိတ်ဆက်ပေးခဲ့ သည်။

မြသန်းတင့်သည် ၁၉၆၂-ခုနှစ်တွင် အာဏာသိမ်းယူခဲ့သော ဗိုလ်ချုပ်ကြီးနေဝင်း ၏ စစ်အစိုးရ လက်ထက်တွင် ၁၉၆၃-ခုနှစ်မှ ၁၉၇၂-ခုနှစ်ထိ အကျဉ်းကျခံရသည်။ ကနဦး ရန်ကုန် အင်းစိန်ထောင်တွင် နေခဲ့ရပြီး ၁၉၆၉-ခုနှစ်မှ ၎င်းလွတ်မြောက်သည့်အချိန်ကာလအထိ အိန္ဒိယသမုဒ္ဒရာရှိ ပြစ်ဒဏ်ပေးခြင်းခံရသူများကို တစ်နေရာတည်းတွင်ထားရှိသည့် ကိုးကိုးကျွန်းတွင် ၃-နှစ်ကြာနေထိုင်ခဲ့ရသည်။

ဘဝနိဂုံး
၁၉၉၈ ခုနှစ်၊ ဖေဖော်ဝါရီလ ၁၈ ရက်နေ့ ည ၉ː၁၅ တွင် ဦးနှောက်၌ သွေးယိုစီးသည့်ရောဂါဖြင့် ရန်ကုန်မြို့၌ ကွယ်လွန်သည်။ ဆုံးပါးချိန်တွင် ဇနီး ဒေါ်ခင်မမ နှင့် သားသမီးလေးဦး ကျန်ရစ်သည်။

ရေးသားလက်စ စာအုပ်များ
ကွန်လွန်ချိန်၌ အောက်ပါစာအုပ်များမှာ ရေးသားဆဲ ဖြစ်သည် −

ဒေါက်တာ မမိုးသူ
အရှေ့တစ်ခွင်လုံး နီ
ကလောင် အမည်ကွဲများ
မြသန်းတင့်
ဇောတိက
ထက်အောင်
မေမေလှိုင်
မင်းနန္ဒာ
မြသန်း
စောယွမ်း
ရဲအောင်ဇေ
မောင်သစ်တည်
အုတ်လှငယ်
   ''';
   static const String ThaKhinKoThawHmine = '''ဆရာကြီး သခင်ကိုယ်တော်မှိုင်းအား ၁၈၇၆ ခုနှစ် မတ်လ ၂၃ ရက်နေ့ မြန်မာ သက္ကရာဇ် ၁၂၃၇ ခုနှစ် တပေါင်းလပြည့်ကျော် ၁၄ ရက် ကြာသပတေးနေ့တွင် အဖ ဦးစံဒွန်း၊ အမိ ဒေါ်အုန်းတို့က ပြည်ခရိုင် ရွှေတောင်မြို့နယ် ဝါးလယ်ရွာတွင် မွေးဖွားခဲ့သည်။ မွေးချင်း ၅ ယောက်အနက် ဒုတိယမြောက်ဖြစ်ကာ ငယ်နာမည်မှာ မောင်လွမ်းမောင် ဖြစ်သည်။
ငယ်ဘဝနှင့်ပညာရေး
ငယ်စဉ်က ကျီးသဲလေးထပ်ဆရာတော်ဘုရားကြီးထံတွင် စာပေပညာကို ဆည်းပူးလေ့လာ သင်ယူခဲ့သည်။ ၁၈၈၃ ခုနှစ်တွင် ဦးလေးတော်သူ ဦးပဇင်း ဦးသီရိနှင့်အတူ မန္တလေးသို့ လိုက်ပါသွားပြီး မြတောင်ကျောင်းတိုက် ဆရာတော်ဘုရားကြီးထံတွင် ကိုရင်ဝတ်ဖြင့် ပညာဆက်လက်ဆည်းပူးခဲ့သည်။ ရှင်အမည်မှာ ပဏ္ဍိတ ဖြစ်သည်။

၁၈၈၅ ခုနှစ် နိုဝင်ဘာလ ၂၉ ရက်နေ့တွင် နောက်ဆုံး မြန်မာဘုရင် သီပေါမင်းနှင့်မိဖုရား ပါတော်မူသည့် မြင်ကွင်းကို စာတော်ဝန် ဦးစံကျောင်း လက်ယမ်းပေါ်မှ မြင်တွေ့ခဲ့ရသည်။ ထိုနေ့မှာပင် စစ်ကိုင်းဘက်သို့ တောထွက်ခဲ့သည်။ စစ်ကိုင်း၊ ချောင်းဦး၊ မုံရွာ၊ အလုံ၊ မောင်းထောင်၊ ဘုတလင်၊ ကန္နီ ဒေသများတွင် (၆) နှစ်ခန့်လှည့်လည်၍ စာပေပညာသင်ယူခဲ့ သည်။ အဂ္ဂိရတ်ဖိုထိုးခြင်းကိုလည်း ဝါသနာပါခဲ့သည်။

အိမ်ထောင်ရေးနှင့်အလုပ်အကိုင်
၁၈၉၄ ခုနှစ်တွင် အဖ ဦးစံဒွန်းကွယ်လွန်သည်။ ၁၈၉၇ ခုနှစ်တွင် အစိုးရစစ် (၇) တန်းစာမေးပွဲကို မုံရွာမြို့ အလွတ်ပညာသင်ကျောင်းမှ ဦးပဏ္ဍိတ ရဟန်းအမည်ဖြင့် ဖြေဆိုအောင်မြင်ခဲ့သည်။ ၁၈၉၈ ခုနှစ်တွင် မော်လမြိုင်မြို့သို့ သွားရောက်ပြီး မြန်မာ့တိုင်း သတင်းစာတွင် ပဏ္ဍိလေးဟူသော ကလောင်အမည်ဖြင့် စာများ ကဗျာများ ရေးသားခဲ့သည်။[၁]

၁၉၀၀ ပြည့်နှစ် အသက် ၂၄ နှစ်အရွယ်တွင် ရန်ကုန်မြို့သို့ ရောက်ရှိလာပြီ ဇမ္ဗူ့ကျက်သရေ ပုံနှိပ်တိုက်တွင် စာစီအလုပ်ဝင်လုပ်သည်။ မကြာမီပင် ထိုပုံနှိပ်တိုက်တွင် စာပြင်ဆရာ ဖြစ်လာသည်။

၁၉၀၃ ခုနှစ်တွင် ရန်ကုန်မြို့ ကြည့်မြင်တိုင် ငါးကျော်ဖိုရပ်နေ ဆန်စပါးပွဲစား ဦးနု၊ ဒေါ်နှင်းတို့၏သမီး ဒေါ်ရှင်နှင့် အကြောင်းပါခဲ့သည်။ ထိုနှစ်မှာပင် ဇမ္ဗူ့ကျက်သရေ ပုံနှိပ်တိုက်မှ ရန်ကုန်တိုင်း သတင်းစာတိုက်သို့ ပြောင်းရွှေ့ လုပ်ကိုင်သည်။


ဆရာကြီးသခင်ကိုယ်တော်မှိုင်း
မောင်လွမ်းမှဆရာလွမ်းဘဝ
ဇာတ်စာအုပ်များလည်း အများအပြား ရေးသားခဲ့သည်။ ပြဇာတ်ပေါင်း ၈၀ ခန့် ရေးသားပြုစုခဲ့သည်။ ထို့နောက် မော်လမြိုင်မြို့ မြန်မာတိုင်းမ်သတင်းစာ အယ်ဒီတာအဖြစ် ဝင်ရောက်လုပ်ကိုင်ကာ ပဏ္ဍိလေး၊ မောင်သမာဓိ အမည်များဖြင့် ဆောင်းပါးများ ရေးသားခဲ့သည်။ ၁၉၀၅ ခုနှစ်တွင် ရွှေတောင်မောင်လွမ်း ကလောင်အမည်ဖြင့် မော်လမြိုင်ရာဇဝင် ဝတ္ထုကို ရေးသားထုတ်ဝေခဲ့သည်။

ထိုနောက် ကဝိသာရ မြဉ္ဇူကျမ်း၊ ပရမတ္တသံခိပ်အခြေကျမ်း (ဒုတိယတွဲ)တို့ကို ဆရာလွမ်း အမည်ဖြင့် ရေးသားခဲ့ပြန်သည်။ ၁၉၀၇ ခုနှစ်တွင် မြန်မာတိုင်းမ်သတင်းစာ ထုတ်ဝေမှု ရပ်ဆိုင်းသွားသောအခါ ဟင်္သာတမြို့ အမရဝတီစာပုံနှိပ်တိုက်တွင် စာပြုအဖြစ် နှင့် အယ်ဒီတာအဖြစ် ခေတ္တဝင်ရောက်လုပ်ကိုင်သည်။

၁၉၁၀ ပြည့်နှစ်တွင် သူရိယသတင်းစာ စတင်ထုတ်ဝေသောအခါ အယ်ဒီတာအဖြစ် တာဝန်ယူ လုပ်ကိုင်ခဲ့သည်။ ခေါင်းဆောင်ကြီးနှင့် ဘုန်းကြီးဒီပနီတို့ကို ရေးသားခဲ့သည်။ ကဗျာ ပရမတ္တသင်္ဂြိုဟ်ကို ရေးသားပြုစု ထုတ်ဝေခဲ့သည်။ မြန်မာရာဇဝင်ချုပ်၊ ရွှေနတ်တောင်ဘုရား စာအုပ်များကို ဆရာလွန်းအမည်ဖြင့် ရေးသားထုတ်ဝေခဲ့သည်။[၂]

ချဉ်ပေါင်ရွက်သည်မောင်မှိုင်း
၁၉၁၂ ခုနှစ် တဝိုက်တွင် ခေတ်ပညာတတ် မြန်မာလူငယ်များအကြားတွင် အမည်ရှေ့၌ မစ္စတာတပ်ခြင်း ခေတ်စားကာ အင်္ဂလိပ်ကို အထင်တကြီး ရှိနေကြသည်။ အသင်းအစည်းအဝေးများတွင်ပင် မစ္စတာမေအောင်၊ မစ္စတာဘဖေ၊ မစ္စတာသိမ်းမောင် စသည်ဖြင့် မှတ်တမ်းတင် ရေးသားနေကြလေရာ ဆရာကြီးမှာ လွန်စွာစိတ်မကောင်း ဖြစ်ရသည်ဟု ဆိုသည်။ တိုင်းပြည်ခေါင်းဆောင်လုပ်ကြရမည့် လူငယ်များအမည်ရှေ့က မစ္စတာအမြီးပြုတ်သွားအောင် လုပ်မှဖြစ်တော့မည်ဟု ကြံစည်မိသည်။

ထိုအချိန်က ဝန်စာရေးဦးကြီး ရေးသားသည့် “ချဉ်ပေါင်ရွက်သည်မောင်မှိုင်း” ဝတ္ထုထွက်နေသည်။ ထိုဝတ္ထုထဲမှ ဇာတ်လိုက် မောင်မှိုင်းသည် လူရှုပ်လူပွေ၊ ကြာသမား မြာပွေသူဖြစ်၍ စာဖတ်သူတို့က အော့နှလုံးနာကြသည်။ ဆရာကြီးသည် ထိုမောင်မှိုင်း အမည်ကို ယူကာ ရှေ့က မစ္စတာတပ်ပြီး မစ္စတာမောင်မှိုင်း ကလောင်အမည်ယူ၍ သူရိယသတင်းစာတွင် ကြာ ဋီကာ ဆောင်းပါးများ ရေးသားသည်။ ထိုနောက် သူရိယသတင်းစာတွင်ပင် မစ္စတာမောင်မှိုင်း အမည်ဖြင့် “ဗိုလ်ဋီကာ” ဆောင်းပါးများ ဆက်လက်ရေးသားခဲ့သည်။ ထိုစဉ်က ဘိလပ်ပြန်ခေါ် နိုင်ငံခြားပြန်များ ယူကေနိုင်ငံမှ ပြန်လာသူများအကြားတွင် ထိုဆောင်းပါးများကြောင့် အတော်ဂယက်ရိုက် ပွက်လောထသွားသည်။ သတင်းစာတိုက်သို့ မေးကြ မြန်းကြ၊ ဆူပူကြ အပြန်အလှန် ဆောင်းပါးများ ရေးသားကြသည်။ ထိုနောက်ပိုင်းတွင် မြန်မာအမည်များရှေ့က မစ္စတာများ ပြုတ်သွားသည်။

အယ်ဒီတာဘဝ
ဆရာကြီး အသက် ၄၀ အရွယ် ၁၉၁၄-၁၅ ခန့်တွင် ဇနီးသည် ဒေါ်ရှင် ကွယ်လွန်သည်။ သားသမီးလေးဦးကျန်ခဲ့ကာ အငယ်ဆုံးသမီးလေးမှာ ၁၁ လအရွယ်သာရှိသေးသည်။ ဆရာကြီး အလွန် ကသီလင်တ ဖြစ်ရသည်။ ထိုမျှ ဒုက္ခရောက်သည့် နှစ်ပိုင်းများတွင် ဆရာကြီးသည် အရေးကြီးသည့် ဗိုလ်ဋီကာဆောင်းပါးများကို ရေးသားခဲ့သည်။ စာအုပ် အဖြစ် လည်း ရိုက်နှိပ်ထုတ်ဝေ နိုင်ခဲ့သည်။

ဆရာကြီးသည် ၁၉၂၀ ပြည့်နှစ်ခန့်အထိ သူရိယ သတင်းစာတိုက်တွင် မြန်မာစာဘက်ဆိုင်ရာ အယ်ဒီတာအဖြစ် ဆောင်ရွက်ခဲ့သည်။ သူရိယတွင် အယ်ဒီတာလုပ်သည်မှာ တိုင်းပြည်အကျိုး အတွက် ဖြစ်သော်လည်း သပိတ်မှောက် ကျောင်းသားများ ကိစ္စမှာ အလွန် အရေးကြီးသော အမျိုးသားရေး ကိစ္စဟု မြင်ကာ စားဝတ်နေရေး အခက်အခဲရှိသည့်ကြားမှ ကျောင်းသားများနှင့် အမ်အေ ဦးမောင်ကြီးတို့၏ တောင်းပန်ချက်အရ သူရိယ သတင်းစာမှ အလုပ်ထွက်ပြီး ဗဟန်း အမျိုးသားကောလိပ်တွင် မြန်မာစာပေနှင့် ရာဇဝင်ဘာသာရပ်များ ပို့ချသင်ကြားသည့် တာဝန်ကို ယူခဲ့သည်။

ရေးသားခဲ့သည့်ဋီကာများ
မှန်နန်းရာဇဝင်တော်ကြီးကို ပြင်ဆင်တည်းဖြတ်ကာ ၁၉၂၁ ခုနှစ်မှာပင် ရေးသားထုတ်ဝေခဲ့သည်။ ၁၉၁၉ ခုနှစ်က ရေးသားခဲ့သော ဒေါင်းဋီကာကိုလည်း အမျိုးသား ပညာရေး အဖွဲ့ သင်ခန်းစာ (သင်ရိုး) ကော်မတီက ကျောင်းသုံးစာအုပ်အဖြစ် ပြဋ္ဌာန်း ပေးခဲ့ သည်။ ၁၉၂၁ ခုနှစ်တွင် ဗြိတိသျှ အိမ်ရှေ့စံ ဝေလမင်းသား ဂုဏ်ပြုရတုရေးရန် ဉာဏ်ပူဇော်ခ ၁၀၀၀ ကျပ် (ထိုခေတ်က ရွှေတစ်ကျပ်သားကို မြန်မာကျပ် ၁၀ ကျော်သာရှိ) ချီးမြှင့်ပါမည်ဟု ဦးမေအောင်က ပန်ကြားရာ ဆရာကြီးက ငြင်းပယ်ခဲ့သည်။

၁၉၂၂ ခုနှစ်တွင် မျောက်ဋီကာ၊ ၁၉၂၃ နိုင်ငံရေး အကွဲအပြဲ ခေတ်တွင် မြောက်ကဏ္ဍိ တို့ကိုရေးခဲ့သည်။ ၁၉၂၅ ခုနှစ်တွင် မူလဂျီစီဘီအေ ဝံသာနုများနှင့် ၂၁ ဦးဂိုဏ်းသားများ စင်ပြိုင်ဖြစ်လာသည်ကို ပြန်လည် ညီညွတ်ကြစေရန် ဗန္ဓုလ ဂျာနယ်မှနေ၍ ခွေးဋီကာ ဆောင်းပါးများ ရေးသား သတိပေးခဲ့သည်။ ရန်ကုန်တက္ကသိုလ် ကျောင်းသားသပိတ်ကြီးကို မော်ကွန်းတင်ထားသော ဘွိုင်းကောက်ဋီကာကိုလည်း ရေးသားကာ ၁၉၂၇ ခုနှစ်တွင် ထုတ်ဝေခဲ့သည်။

မစ္စတာ မောင်မှိုင်းမှ သခင်ကိုယ်တော်မှိုင်းဘဝ
၁၉၂၈-၂၉ ခုနှစ်များတွင် တောပုန်းကြီး စံဖဲ ကြိုးမိန့်ကျသည့် အမှုတွင် အယူခံ ကိစ္စကို ဆရာကြီး ဦးဆောင်ပေးခဲ့ပြီး မြင်းခြံထောင်အထိသွားကာ စံဖဲကို တွေ့ဆုံအားပေးခဲ့ သည်။

၁၉၃၀ ပြည့်နှစ်တွင် ဆရာစံ တောင်သူလယ်သမား အရေးတော်ပုံကြီး ပေါ်ပေါက်လာသည့် အခါ သူရိယ သတင်းစာတွင် ဂဠုန် ဒီပနီ ဆောင်းပါးများရေးသားကာ လွတ်လပ်ရေးအတွက် တောင်သူလယ်သမား တော်လှန်သူများ ဘက်မှ ဆရာကြီးသည် မားမားရပ်ခဲ့သည်။

၁၉၃၄ ခုနှစ်တွင် ရေနံချောင်းမြို့တွင် ကျင်းပသော ပထမအကြိမ် သခင်များ ညီလာခံသို့ တက်ရောက်ပြီး တို့ဗမာ အစည်းအရုံး၏ နာယကအဖြစ် တင်မြှောက်သည်ကို လက်ခံခဲ့သည်။ မစ္စတာ မောင်မှိုင်းမှ သခင်ကိုယ်တော်မှိုင်း အမည်သို့ ပြောင်းလဲခဲ့သည်။ ထိုနှစ်မှစ၍ တစ်နိုင်ငံလုံး အနှံ့အပြားသို့ သခင်လူငယ်များနှင့်အတူ တရားဟောထွက်ခဲ့သည်။ ၁၉၃၆ ခုနှစ် ရွေးကောက်ပွဲတွင် သခင်များ ပါဝင်ယှဉ်ပြိုင်ကြရာ လူငယ်များနှင့် အတူ ဆရာကြီး လိုက်လံ တရားဟောသည်။

၁၉၃၈ ခုနှစ်တွင် သခင်ဋီကာကို ရေးသားသည်။ ရေနံမြေ အလုပ်သမား အရေးတော်ပုံတွင် လည်း တက်ကြွစွာ အားပေးခဲ့သည်။ ၁၉၃၉ ခုနှစ်တွင် မော်လမြိုင်ညီလာခံကို တက်ရောက် သည်။ ထိုခရိုင်အတွင်း အနှံ့ တရားဟောထွက်ခဲ့သည်။ ၁၉၄၀ သာယာဝတီ ညီလာခံ၊ ၁၉၄၁ ခုနှစ် မန္တလေး ညီလာခံနှင့် ပဲခူး လယ်သမား ညီလာခံများကို တက်ရောက်ခဲ့သည်။ တို့ဗမာ အစည်းအရုံး နာယကအဖြစ် နိုင်ငံတစ်ဝှမ်း နယ်ချဲ့ ဆန့်ကျင်ရေး အမျိုးသားလွတ်မြောက်ရေး တရားများ ဟောခဲ့သည်။

၁၉၄၁ ခုနှစ်တွင် ဗြိတိသျှ နယ်ချဲ့ တော်လှန်ရေးအတွက် ဆရာကြီး မြေအောက် လျှိုး ခဲ့ရသည်။ ဗြိတိသျှ၏ နံပါတ် တစ် ရန်သူတော်အဖြစ် ကြေညာကာ ဖမ်းဝရမ်း အထုတ်ခံခဲ့ရ သည်။ ဟင်္သာတ ခရိုင် ဒေါင့်ကြီးရွာ၊ ထိုမှတဆင့် ဇလွန် တစ်ဘက်ကမ်း၊ ထိုနောက် သာယာဝတီ၊ အနောက်စံရွေး၊ ဘိုခေါင်၊ ထိုမှ ပဲခူး စသဖြင့် အမျိုးမျိုး ဒုက္ခခံကာ လှည့်လည် တိမ်းရှောင်နေခဲ့ရသည်။

၁၉၄၄-၄၅ ဖက်ဆစ်ဂျပန်တော်လှန်ရေးကာလတွင်လည်း ဆရာကြီးသည် တပည့် သခင်များနှင့် အတူ ရှောင်တိမ်း ပုန်းအောင်းနေရပြန်သည်။

ပြည်တွင်းငြိမ်းချမ်းရေး ဆောင်ရွက်ချက်များ
၁၉၅၃ ခုနှစ်တွင် တရုတ်ပြည်၊ မွန်ဂိုးလီးယား၊ ဟန်ဂေရီ နှင့် ဆိုဗီယက် ယူနီယံနိုင်ငံများသို့ ခရီးလှည့်လည်ခဲ့သည်။ ၁၉၅၅ ခုနှစ်တွင် ဆရာကြီးအား ငြိမ်းချမ်းရေး စတာလင်ဆု အပ်နှင်းခဲ့ကြသည်။[၃] ၁၉၅၇ ခုနှစ်တွင် သီဟိုဠ် နှင့် အိန္ဒိယ နိုင်ငံများသို့ ငြိမ်းချမ်းရေး ကွန်ဖရက် တက်ရောက်ရန် သွားရောက်ခဲ့သည်။ ၁၉၆၀ ပြည့်နှစ်တွင် အရှေ့ ဂျာမနီ ဟမ်းဘတ် တက္ကသိုလ်က ဂုဏ်ထူးဆောင် ပါရဂူဘွဲ့ (ဒေါက်တာဘွဲ့) ကို ဆရာကြီးအားအပ်နှင်းခဲ့သည်။ ထိုနှစ်တွင်ပင် အရှေ့ ဂျာမနီ သို့ ဆေးကုသရန် သွားရောက်ခဲ့သည်။ ၁၉၆၃ ခုနှစ် ဩဂုတ်လ ၆ ရက်နေ့ ရန်ကုန်မြို့တော်ခန်းမတွင် ကျင်းပသည့် ဟီရိုရှီးမားနေ့ အခမ်းအနားသို့ သဝဏ်လွှာ ပေးပို့ခဲ့သည်။

ကွယ်လွန်ချိန်
၁၉၆၄ ခုနှစ် ဇူလိုင်လ ၂၃ ရက် ကြသပတေးနေ့ နံနက် ၁ နာရီခွဲတွင် လူကြီးရောဂါဖြင့် ကွယ်လွန်ချိန်တွင် သားသမီး နှစ်ယောက် မြေး ၁၅ ယောက်၊ မြစ် ၆ ယောက် ကျန်ရစ်ခဲ့သည်။

 ''';
 
}